#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`
<details><summary>Show Plan</summary>
```terraform

module.apiGateway.data.aws_vpcs.selected: Reading...
data.aws_iam_role.name: Reading...
module.apiGateway.data.aws_lb.eks_lb_api: Reading...
data.aws_iam_role.name: Read complete after 0s [id=LabRole]
module.apiGateway.data.aws_vpcs.selected: Read complete after 1s [id=us-east-1]
module.apiGateway.data.aws_subnets.selected: Reading...
module.apiGateway.data.aws_vpc.eks_vpc: Reading...
module.apiGateway.data.aws_subnets.selected: Read complete after 0s [id=us-east-1]
module.apiGateway.data.aws_subnet.selected["subnet-0100fc516eba5c443"]: Reading...
module.apiGateway.data.aws_subnet.selected["subnet-0883948b9be5124a2"]: Reading...
module.apiGateway.data.aws_subnet.selected["subnet-068ba086fa9ec5f3c"]: Reading...
module.apiGateway.data.aws_subnet.selected["subnet-073cd9360da18e0fa"]: Reading...
module.apiGateway.data.aws_subnet.selected["subnet-0d9cde3667aaefbb1"]: Reading...
module.apiGateway.data.aws_subnet.selected["subnet-00b7f11ca75a8cd81"]: Reading...
module.apiGateway.data.aws_subnet.selected["subnet-0883948b9be5124a2"]: Read complete after 0s [id=subnet-0883948b9be5124a2]
module.apiGateway.data.aws_subnet.selected["subnet-0d9cde3667aaefbb1"]: Read complete after 0s [id=subnet-0d9cde3667aaefbb1]
module.apiGateway.data.aws_subnet.selected["subnet-073cd9360da18e0fa"]: Read complete after 0s [id=subnet-073cd9360da18e0fa]
module.apiGateway.data.aws_subnet.selected["subnet-0100fc516eba5c443"]: Read complete after 0s [id=subnet-0100fc516eba5c443]
module.apiGateway.data.aws_subnet.selected["subnet-068ba086fa9ec5f3c"]: Read complete after 0s [id=subnet-068ba086fa9ec5f3c]
module.apiGateway.data.aws_subnet.selected["subnet-00b7f11ca75a8cd81"]: Read complete after 0s [id=subnet-00b7f11ca75a8cd81]
module.apiGateway.data.aws_vpc.eks_vpc: Read complete after 0s [id=vpc-06a0514238427dc28]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_secretsmanager_secret.lambda_auth_credentials will be created
  + resource "aws_secretsmanager_secret" "lambda_auth_credentials" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "lambda-auth-credentials"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret_version.lambda_auth_credentials will be created
  + resource "aws_secretsmanager_secret_version" "lambda_auth_credentials" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.apiGateway.aws_api_gateway_deployment.gateway_deployment will be created
  + resource "aws_api_gateway_deployment" "gateway_deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "Development"
    }

  # module.apiGateway.aws_api_gateway_integration.lambda_auth will be created
  + resource "aws_api_gateway_integration" "lambda_auth" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.apiGateway.aws_api_gateway_integration.lambda_cadastro will be created
  + resource "aws_api_gateway_integration" "lambda_cadastro" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.apiGateway.aws_api_gateway_method.auth will be created
  + resource "aws_api_gateway_method" "auth" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.apiGateway.aws_api_gateway_method.cadastro will be created
  + resource "aws_api_gateway_method" "cadastro" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.apiGateway.aws_api_gateway_method.proxy will be created
  + resource "aws_api_gateway_method" "proxy" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "ANY"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.header.Authorization" = true
          + "method.request.path.proxy"           = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.apiGateway.aws_api_gateway_resource.auth will be created
  + resource "aws_api_gateway_resource" "auth" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "auth"
      + rest_api_id = (known after apply)
    }

  # module.apiGateway.aws_api_gateway_resource.cadastro will be created
  + resource "aws_api_gateway_resource" "cadastro" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "cadastro"
      + rest_api_id = (known after apply)
    }

  # module.apiGateway.aws_api_gateway_resource.proxy will be created
  + resource "aws_api_gateway_resource" "proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + rest_api_id = (known after apply)
    }

  # module.apiGateway.aws_api_gateway_rest_api.main will be created
  + resource "aws_api_gateway_rest_api" "main" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "Gateway used for EKS. Managed by Terraform."
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "eks-gateway"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.apiGateway.aws_api_gateway_rest_api.tech_lanches_api_gateweay will be created
  + resource "aws_api_gateway_rest_api" "tech_lanches_api_gateweay" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "tech-lanches-api-gateway"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags                         = {
          + "Name" = "techlanches_apigateway"
        }
      + tags_all                     = {
          + "Name" = "techlanches_apigateway"
        }
    }

  # module.apiGateway.aws_lambda_permission.apigateway_lambda_auth will be created
  + resource "aws_lambda_permission" "apigateway_lambda_auth" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "tech-lanches-lambda-auth"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.apiGateway.aws_lambda_permission.apigateway_lambda_cadastro will be created
  + resource "aws_lambda_permission" "apigateway_lambda_cadastro" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "tech-lanches-lambda-cadastro"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.cognito.aws_cognito_user_pool.tech_lanches_clientes_pool will be created
  + resource "aws_cognito_user_pool" "tech_lanches_clientes_pool" {
      + alias_attributes           = [
          + "email",
          + "preferred_username",
        ]
      + arn                        = (known after apply)
      + auto_verified_attributes   = [
          + "email",
        ]
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "tech-lanches-clientes-pool"
      + sms_verification_message   = (known after apply)
      + tags                       = {
          + "Name" = "tech_lanches_clientes_pool"
        }
      + tags_all                   = {
          + "Name" = "tech_lanches_clientes_pool"
        }

      + username_configuration {
          + case_sensitive = false
        }
    }

  # module.cognito.aws_cognito_user_pool_client.tech_lanches_clientes_pool_client will be created
  + resource "aws_cognito_user_pool_client" "tech_lanches_clientes_pool_client" {
      + access_token_validity                         = (known after apply)
      + allowed_oauth_flows                           = (known after apply)
      + allowed_oauth_flows_user_pool_client          = (known after apply)
      + allowed_oauth_scopes                          = (known after apply)
      + auth_session_validity                         = (known after apply)
      + callback_urls                                 = (known after apply)
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = (known after apply)
      + explicit_auth_flows                           = [
          + "ALLOW_ADMIN_USER_PASSWORD_AUTH",
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_SRP_AUTH",
        ]
      + id                                            = (known after apply)
      + id_token_validity                             = (known after apply)
      + logout_urls                                   = (known after apply)
      + name                                          = "pool-client"
      + prevent_user_existence_errors                 = (known after apply)
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = (known after apply)
      + supported_identity_providers                  = (known after apply)
      + user_pool_id                                  = (known after apply)
      + write_attributes                              = (known after apply)
    }

  # module.lambda.aws_lambda_function.tech_lanches_lambda_auth will be created
  + resource "aws_lambda_function" "tech_lanches_lambda_auth" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "../Serverless/auth_lambda.zip"
      + function_name                  = "tech-lanches-lambda-auth"
      + handler                        = "TechLanchesLambda::TechLanchesLambda.Functions_LambdaAuth_Generated::LambdaAuth"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::590183830079:role/LabRole"
      + runtime                        = "dotnet8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "tech-lanches-lambda"
        }
      + tags_all                       = {
          + "Name" = "tech-lanches-lambda"
        }
      + timeout                        = 30
      + version                        = (known after apply)
    }

  # module.lambda.aws_lambda_function.tech_lanches_lambda_cadastro will be created
  + resource "aws_lambda_function" "tech_lanches_lambda_cadastro" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "../Serverless/auth_lambda.zip"
      + function_name                  = "tech-lanches-lambda-cadastro"
      + handler                        = "TechLanchesLambda::TechLanchesLambda.Functions_LambdaCadastro_Generated::LambdaCadastro"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::590183830079:role/LabRole"
      + runtime                        = "dotnet8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "tech-lanches-lambda"
        }
      + tags_all                       = {
          + "Name" = "tech-lanches-lambda"
        }
      + timeout                        = 30
      + version                        = (known after apply)
    }

Plan: 19 to add, 0 to change, 0 to destroy.

```
</details>
*Pushed by: @gabriellima09, Action: `pull_request`*